ednieuw/ESP32Communications/ESP32Arduino_CommV031/ESP32Arduino_CommV031.ino
//------------------------------------------------------------------------------              //
// LDR PHOTOCELL
//------------------------------------------------------------------------------
//                                                                                            //
const byte SLOPEBRIGHTNESS    = 50;                                                           // Steepness of with luminosity of the LED increases
const int  MAXBRIGHTNESS      = 255;                                                          // Maximum value in bits  for luminosity of the LEDs (1 - 255)
const byte LOWBRIGHTNESS      = 5;                                                            // Lower limit in bits of Brightness ( 0 - 255)   
byte       TestLDR            = 0;                                                            // If true LDR info is printed every second in serial monitor
int        OutPhotocell;                                                                      // stores reading of photocell;
int        MinPhotocell       = 999;                                                          // stores minimum reading of photocell;
int        MaxPhotocell       = 1;                                                            // stores maximum reading of photocell;
uint32_t   SumLDRreadshour    = 0;
uint32_t   NoofLDRreadshour   = 0;
int        LDRread            = 0;
//-------------------------------------------- 
// IR-RECEIVER
//-------------------------------------------- 
//#define NO_LED_SEND_FEEDBACK_CODE                                                             // Do not flash the BUILTIN LED on Arduino
String* ButtonNames;
byte NOOFBUTTONS;
String EnteredDigits     = "";                                                                // Store typed digits InputString
String ButtonLNames[]    = {"0", "1", "2", "3", "4", "5", "6", "7", "8", "9",                 // Large IR-remote (H03)
                           "UP", "DOWN", "LEFT", "RIGHT", "POWER", "OK","ONOFF"};             // Runtime button info                                     
String ButtonTNames[]    = {"MIN-1", "MIN+1","UUR-1","UUR+1","POWER","ONOFF"};                // Small IR-remote (H04)
int currentLearningIndex = 0;
uint32_t IR_StartTime    = 0;                                                                 // Time IR remote Power is on turn. Off after 1 minute
bool IR_PowerOnstate     = false;                                                             // Is the power On or Off
bool learningMode        = false;
struct StoredButtonMapping                                                                    // Button mapping structure for storage
{
  uint8_t  protocol;                                                                          // decode_type_t as byte
  uint16_t command;
  uint16_t address;
  bool     learned;
};

struct IRRemoteStorage
{
  uint16_t learnedRemoteAddress  = 0;
  byte     learnedRemoteProtocol = 0;
  bool     remoteIdentified      = false;
  StoredButtonMapping buttons[30];                                                            // NOOFBUTTONS = 15 but space for 15 more
  int      Checksum              = 0;
} IRMem;

//------------------------------------------------------------------------------              //
// CLOCK initialysations
//--------------------------------------------                                 
static uint32_t msTick;                                                                       // Number of millisecond ticks since we last incremented the second counter
byte      lastminute = 0, lasthour = 0, lastday = 0, sayhour = 0;
struct    tm timeinfo;                                                                        // storage of time 

//--------------------------------------------                                                //
// BLE  RX-TX //#include <NimBLEDevice.h>
//--------------------------------------------
static NimBLEServer *pServer      = NULL;
static NimBLECharacteristic * pTxCharacteristic;
static bool BLEConnected    = false;
static bool oldBLEConnected = false;
std::string ReceivedMessageBLE = "";
unsigned long BLEConnectedSince   = 0;
static unsigned long TRConnectedSince = 0;                                                      // Separate timer for TimeReceiver activity (avoid sharing with server timeout)

#define SERVICE_UUID           "6E400001-B5A3-F393-E0A9-E50E24DCCA9E"                         // UART service UUID
#define CHARACTERISTIC_UUID_RX "6E400002-B5A3-F393-E0A9-E50E24DCCA9E"
#define CHARACTERISTIC_UUID_TX "6E400003-B5A3-F393-E0A9-E50E24DCCA9E"

//--------------------------------------------                                                //
// BLE TimeReceiver  //#include <NimBLEDevice.h>
//--------------------------------------------
 #define TIMESENDER_DEVICE_NAME "BLE-UARTtime"
 #define TIMERECEIVER_MIN_RSSI    (-90)

static NimBLEClient*               pClient        = nullptr;
static NimBLERemoteCharacteristic* pRemoteTX      = nullptr;
static NimBLERemoteCharacteristic* pRemoteRX      = nullptr;

// Found address and flags
static NimBLEAddress TRfoundAddr;
static bool          TRhaveFoundAddr      = false;
static bool          TRconnectRequested   = false;
static bool          TRConnecting         = false;
static bool          TRConnected          = false;
static unsigned long TRconnectStartms     = 0;
static unsigned long LastTimeReceiverScan = 0;
static bool          TimeReceiverRunning  = false; 
static const unsigned long CONNECT_TIMEOUT_MS = 10000;                         // 10s


/**************************************************************************************************
   TIME SENDER  (BLE SERVER MODE)
**************************************************************************************************/

static NimBLEServer*           TSpServer           = nullptr;                                   // Comment line ...
static NimBLEService*          TSpService          = nullptr;                                   // Comment line ...
static NimBLECharacteristic*   TSpTX               = nullptr;                                   // Comment line ...
static NimBLECharacteristic*   TSpRX               = nullptr;                                   // Comment line ...
static NimBLEAdvertising*      TSpAdvertising      = nullptr;                                   // Comment line ...

static bool                    TSClientConnected   = false;
static bool                    TSClientSubscribed  = false;                                    // True once client has enabled notifications (CCCD written)
static bool                    TimeSenderServerRunning = false;                                // Comment line ...
static unsigned long           TSsendDelayms       = 0;
static bool                    TSdatePending       = false;                                     // Comment line ...
static uint16_t                TSconnHandle        = 0;
#define UART_SERVICE_UUID        "6E400001-B5A3-F393-E0A9-E50E24DCCA9E"                         // Comment line ...
#define UART_CHARACTERISTIC_RX   "6E400002-B5A3-F393-E0A9-E50E24DCCA9E"                         // Comment line ...
#define UART_CHARACTERISTIC_TX   "6E400003-B5A3-F393-E0A9-E50E24DCCA9E"                         // Comment line ...

