ednieuw/ESP32Communications/ESP32Arduino_CommV031/ESP32Arduino_CommV031.ino
 if (millis() < MCURESTART_RESET_AFTER_MS) return;      // Not yet stable long enough
 
 if (Mem.MCUrestarted != 0)
   {
    Tekstprintlnf("Stable for %u min, resetting MCUrestart counter (was %u)",
                  (unsigned)(MCURESTART_RESET_AFTER_MS / 60000),
                  (unsigned)Mem.MCUrestarted);
    Mem.MCUrestarted = 0;
    StoreStructInFlashMemory();
   }
 mcuRestartCounterCleared = true;
}
//--------------------------------------------                                                //
// COMMON Input from Bluetooth, Serial or HTML page
//--------------------------------------------
void ReworkInputString(String InputString)
{
 if(InputString.length()> 40){Tekstprintln("Input string too long (max40)\n"); return;}       // If garbage return
 InputString.trim();                                                                          // Remove CR, LF etc.
 sptext[0] = 0;                                                                               // Suppress a second print of sptext 
 PendingCommand = "";                                                                         // Clear the global PendingCommand
 if(InputString[0] > 31 && InputString[0] < 127)                                              // Does the string start with a letter?
  {
  int len = InputString.length();
  switch(toupper(InputString[0])) 
   {
    case 'A':                                                                                 // SSID setting
      if(len > 4 && len < 30) 
        {
        InputString.substring(1).toCharArray(Mem.SSID, len);
        snprintf(sptext, sizeof(sptext), "SSID set: %s", Mem.SSID);
        Mem.WIFIcredentials = NOT_SET;    
        WIFIwasConnected = false;    
        } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault. Use between 4 and 30 characters ****");
      break;
      
    case 'B':                                                                                 // Password setting
      if(InputString.equals("BBBB")) 
      {
        snprintf(sptext, sizeof(sptext), "%s,**** Length fault. Use between 5 and 40 characters ****", Mem.Password);
        break;
      }
      if(len > 4 && len < 40) 
        {
        InputString.substring(1).toCharArray(Mem.Password, len);
        snprintf(sptext, sizeof(sptext), "Password set: %s\n Enter @ to reset ESP32 and connect to WIFI and NTP\n WIFI and NTP are turned ON", Mem.Password);
        Mem.NTPOn = Mem.WIFIOn = 1;                                                           // Turn both on
        Mem.WIFIcredentials = NOT_SET;
        WIFIwasConnected = false;
        } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault. Use between 5 and 40 characters ****");
      break;

    case 'C':                                                                                // BLE settings
      if(InputString.equals("CCC")) 
       {
        Mem.BLEOn = 1 - Mem.BLEOn;
        snprintf(sptext, sizeof(sptext), "BLE is %s after restart", Mem.BLEOn ? "ON" : "OFF");
        break;
       }
      if(len > 4 && len < 30) 
       {
        InputString.substring(1).toCharArray(Mem.BLEbroadcastName, len);
        snprintf(sptext, sizeof(sptext), "BLE broadcast name set: %s", Mem.BLEbroadcastName);
        Mem.BLEOn = 1;
       } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault. Use between 4 and 30 characters ****");
      break;
      
    case 'D':                                                                                 // Date entry
      if(len == 9) 
       {
        timeinfo.tm_mday = (int)SConstrainInt(InputString, 1, 3, 0, 31);
        timeinfo.tm_mon  = (int)SConstrainInt(InputString, 3, 5, 0, 12) - 1;
        timeinfo.tm_year = (int)SConstrainInt(InputString, 5, 9, 2000, 9999) - 1900;
        if(DS3231Installed)   SetDS3231Time();
        else snprintf(sptext, sizeof(sptext), "No external RTC module detected");
       } 
      else snprintf(sptext, sizeof(sptext), "****\nLength fault. Enter Dddmmyyyy\n****");
      break;

    case 'E':                                                                                 // Time zone setting
      if(len > 2) 
       {
        InputString.substring(1).toCharArray(Mem.Timezone, len);
        snprintf(sptext, sizeof(sptext), "Timezone set: %s", Mem.Timezone);
       } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault. Use more than 2 characters ****");
      break;

    case 'F':                                                                                 // *** Empty *** 
       snprintf(sptext, sizeof(sptext), "**** No Use option . ****");
       break; 

    case 'G':                                                                                 // Scan WIFI stations
      if(len == 1) 
       {
        CheckforWIFINetwork(true);
        if(WIFIwasConnected) WiFi.reconnect();
       } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault. Enter G ****");
      break;

    case 'H':                                                                                 // Use rotary encoder
      if(len == 3) 
       {
        byte Choice = (byte)SConstrainInt(InputString, 2, 0, 5);                                 // keep the range between 0 and 5; H00 - H05
        if (Choice <5) Mem.TimeInput = Choice;
        else
            {
            if (Choice ==5) Mem.TimeReceiver = 1 - Mem.TimeReceiver;
            }
        if(Mem.TimeInput > 4) Mem.TimeInput = 0;
        Tekstprintln("*** Restart with @ to activate Rotary, key pad, Time sender app or IR remote ***");    // 
        if(Mem.TimeInput > 0)  {Mem.NTPOn = 0;              Mem.UseDS3231 = 1;}              // Configure related settings based on rotary use 
        else                   {Mem.WIFIOn = Mem.NTPOn = 1; Mem.UseDS3231 = 0;}
        } 
      else Tekstprintln("Error **** Enter H00 (none), H01=Rotary, H02=Membrane, H03 large IR-remote, H04 tiny IR-remote, H05 Time sender app ****");
      sprintf(sptext, "\n Use of rotary encoder is %s\n"
                        "         Use of keypad is %s\n"
                        "Use of large IR-remote is %s\n"
                        " Use of tiny IR-remote is %s\n"
                        "Use of Time sender app is %s",                        
                        Mem.TimeInput == 1 ? "ON" : "OFF", Mem.TimeInput == 2 ? "ON" : "OFF",
                        Mem.TimeInput == 3 ? "ON" : "OFF", Mem.TimeInput == 4 ? "ON" : "OFF",
                        Mem.TimeReceiver   ? "ON" : "OFF");
      Tekstprintln(sptext);      
      sprintf(sptext, "Use DS3231 is %s, WIFI is %s, NTP is %s\n *** Restart clock with @ ***", 
                       Mem.UseDS3231 ? "ON" : "OFF", Mem.WIFIOn ? "ON" : "OFF", Mem.NTPOn ? "ON" : "OFF");     
      if(Mem.TimeInput >2) { while(IrReceiver.decode())  IrReceiver.resume();  }              // Clear all pending commands    
      break;

    case 'I':                                                                                 // Menu
      if(InputString.equalsIgnoreCase("I"))  ShortMenu = true;
      if(InputString.equalsIgnoreCase("II")) ShortMenu = false;
      SWversion(ShortMenu);                                                                   // ShortMenu is true for small menu, false for full menu
      break;
      
    case 'J':                                                                                 // Use DS3231 RTC module
      if(len == 1)
      {
        if(Mem.UseDS3231)                                                                      // Turning DS3231 OFF
         {
          if(Mem.WIFIcredentials == SET_AND_OK)
           {
            Mem.UseDS3231 = 0;
            Mem.WIFIOn    = 1;
            Mem.NTPOn     = 1;
            StoreStructInFlashMemory();
            snprintf(sptext, sizeof(sptext), "DS3231=Off, WIFI=On, NTP=On (restart required)");
           }
          else
           {
            snprintf(sptext, sizeof(sptext), "*** No valid WIFI credentials. DS3231 remains ON ***");
           }
         }
        else                                                                                   // Turning DS3231 ON
         {
          Mem.UseDS3231 = 1;
          Mem.NTPOn     = 0;
          StoreStructInFlashMemory();
          snprintf(sptext, sizeof(sptext), "DS3231=On, NTP=Off, WIFI=%s", Mem.WIFIOn ? "ON" : "OFF");
         }
       }
      else snprintf(sptext, sizeof(sptext), "**** Length fault. Enter J ****");
      break;
      
