ednieuw/ESP32Communications/ESP32Arduino_CommV031/ESP32Arduino_CommV031.ino
    case 'U':                                                                                 // *** Empty *** 
      if(len == 1) 
        {
         Mem.HC12Time = 1 - Mem.HC12Time;                                  // turn off TimeReceiver                                                                                                    
         snprintf(sptext, sizeof(sptext), "HC12 TimeSender is %s after restart (@)", Mem.HC12Time ? "ON" : "OFF");
        } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault U. ****");
      break;
       break;

    case 'W':                                                                                 // WIFI toggle
      if(len == 1) 
       {
        Mem.WIFIOn = 1 - Mem.WIFIOn;
        Mem.NTPOn = Mem.WIFIOn;                                                               // If WIFI is off turn NTP also off
        snprintf(sptext, sizeof(sptext), "WIFI is %s after restart", Mem.WIFIOn ? "ON" : "OFF");
       } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault. Enter W ****");
      break;
      
    case 'X':                                                                                 // NTP toggle
      if(len == 1) 
       {
        Mem.NTPOn = 1 - Mem.NTPOn;
        snprintf(sptext, sizeof(sptext), "NTP is %s after restart", Mem.NTPOn ? "ON" : "OFF");
       } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault. Enter X ****");
      break;

    case 'Y':       
                 // function that will run > 1sec can be placed here                                                                                  // *** Empty *** 
       snprintf(sptext, sizeof(sptext), "**** No Use option . ****");
      break;

    case 'Z':                                                                                 // Start WPS
      if(len == 1) 
       {
        snprintf(sptext, sizeof(sptext), "**** Start WPS on your router");
        WiFi.onEvent(WiFiEvent);
        WiFi.mode(WIFI_STA);
        Tekstprintln("Starting WPS");
        wpsInitConfig();
        wpsStart();
       }
      break;
      
    case '!':                                                                                 // Print times
      if(len == 1) PrintAllClockTimes();
      sprintf(sptext,"\n");
      break;
      
    case '@':                                                                                 // Reset ESP
      if(len == 1) 
       {
        Mem.MCUrestarted = 0;                                                                 // Reset MCUrestart counter to 0    
        Tekstprintlnf("Mem.MCUrestarted reset to 0");
        StoreStructInFlashMemory();
        Tekstprintln("\n*********\n ESP restarting\n*********\n");            
        shouldReboot = true; // ESP.restart();
       } 
      else sprintf(sptext, "**** Length fault. Enter @ ****");
      break;
 
    case '#':                                                                                 // *** Empty *** 
        snprintf(sptext, sizeof(sptext), "**** No Use option . ****");
      break;

    case '$':                                                                                 // *** Empty *** 
       snprintf(sptext, sizeof(sptext), "**** No Use option . ****");
      break;

    case '%':                                                                                 // LED strip type
      if(len == 1) 
       {
        Mem.LEDstrip = 1 - Mem.LEDstrip;
        snprintf(sptext, sizeof(sptext), "LED strip is %s after restart", Mem.LEDstrip ? "WS2812" : "SK6812");
       } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault . ****");
      break;

     case '^':                                                                                 // *** Empty ***
       snprintf(sptext, sizeof(sptext), "**** No Use option . ****");
      break;

    case '&':                                                                                 // Force NTP update
      if(len == 1) 
       {
        if(GetNTPtime(false))  SetDS3231Time();                                               // Only set time in DS3231 if time is valid
        SetRTCTime();
        PrintAllClockTimes();
        sptext[0] =0 ;
       } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault &. ****");
      break;
 
    case '(':
      snprintf(sptext, sizeof(sptext), "**** No Use option . ****");     
      break;

    case ')':
      snprintf(sptext, sizeof(sptext), "**** No Use option . ****");     
      break;

    case '{':  
      if (Mem.TimeInput==3 || Mem.TimeInput==4)
       {
         StartIRLearning();                                                                   // Initializes learning mode,Resets all button data, Prompts for first button
         snprintf(sptext, sizeof(sptext), "Learning IR finished");
       }
      else snprintf(sptext, sizeof(sptext), "IR remote is OFF (Turn it on with H03 or H04 )\nOr no IR remote is installed");
      break;

    case '}':                                                                                 // *** Empty ***
      if(len == 1) 
        {
         Mem.Ringbufcnt = !Mem.Ringbufcnt;
         snprintf(sptext, sizeof(sptext), "Ring buffer counter is %s", Mem.Ringbufcnt ? "ON" : "OFF");
        } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault . ****");
      break;


   case '+':                                                                                 // BLE string toggle
      if(len == 1) 
       {
        Mem.UseBLELongString = 1 - Mem.UseBLELongString;
        snprintf(sptext, sizeof(sptext), "Fast BLE is %s", Mem.UseBLELongString ? "ON" : "OFF");
       } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault. Enter + ****");
      break;

    case '_':                                                                                 // NO USE
      if(len > 1 && len < 4) 
       {
        byte ff = (byte)InputString.substring(1, 3).toInt();
        snprintf(sptext, sizeof(sptext), "No use: %d", ff);
        Tekstprintln(sptext);
       }
      break;      

    case '=':                                                                                 // Print permanent Mem memory
      if(len == 1)  PrintMem(); 
      else snprintf(sptext, sizeof(sptext), "**** Length fault. Enter = ****");
      break;     

    case '0': 
    case '1': 
    case '2':                                                                                 // Time entry compatibility mode
      if(len == 6)                                                                            // The first digit of InputString is 0, 1 or 2
       {
        timeinfo.tm_hour = (int)SConstrainInt(InputString, 0, 2, 0, 23);
        timeinfo.tm_min  = (int)SConstrainInt(InputString, 2, 4, 0, 59);
        timeinfo.tm_sec  = (int)SConstrainInt(InputString, 4, 6, 0, 59);
        SetRTCTime();                                                                         // Always sync ESP32 internal RTC
        if(DS3231Installed)
         {
          SetDS3231Time();                                                                    // Write time to DS3231
          Mem.UseDS3231 = 1;                                                                  // Time source = DS3231
          Mem.NTPOn     = 0;                                                                  // NTP not needed
          Mem.WIFIOn    = 0;                                                                  // WIFI not needed
          StoreStructInFlashMemory();                                                         // Persist settings
          snprintf(sptext, sizeof(sptext), "Time set. DS3231=On, WIFI=Off, NTP=Off");
         }
        else
         {
          Mem.UseDS3231 = 0;
          snprintf(sptext, sizeof(sptext), "Time set (no DS3231). WIFI/NTP unchanged.");
         }
       }   
      else snprintf(sptext, sizeof(sptext), "**** Length fault. Enter Thhmmss ****");
      break;
  }
  Tekstprintln(sptext);
  StoreStructInFlashMemory();                                                                 // Update EEPROM
 }
InputString = "";
lastminute = 99;                                                                              // Force a minute update
}

//--------------------------------------------                                                //
// COMMON Print time input method
// Rotary, Membrane or IR-remote
//--------------------------------------------
void PrintTimeInputMethod(byte Im)
{
  char Method[20];
  switch(Im)
  {
    case 0: strcpy(Method, "None");            break;
    case 1: strcpy(Method, "Rotary");          break;
    case 2: strcpy(Method, "Membrane");        break;
    case 3: strcpy(Method, "Large IR-remote"); break;
    case 4: strcpy(Method, "Tiny Ir-remote");  break;     
   default: strcpy(Method, "Error");
  }
  Tekstprintlnf("Time inputMethod: %s", Method);
}
//--------------------------------------------                                                //
// COMMON Print permanent Mem memory
//--------------------------------------------
void PrintMem(void)
{
 PrintLine(35); 
 PrintHeaps(); 
 PrintLine(35); 
 for (int i=0;i<12;i++) { Tekstprintf("%03d ",Mem.NVRAMmem[i]); }   Tekstprintln("");
 for (int i=12;i<24;i++){ Tekstprintf("%03d ",Mem.NVRAMmem[i]); }   Tekstprintln(""); 
 PrintAllMappings();                                                                          // Print the IR remote keys 
 Tekstprintlnf("Q  DisplayChoice: %d",Mem.DisplayChoice);  
 Tekstprintlnf(" TurnOffLEDsAtHH: %d",Mem.TurnOffLEDsAtHH);                 
 Tekstprintlnf("  TurnOnLEDsAtHH: %d",Mem.TurnOnLEDsAtHH); 
 Tekstprintlnf("F    Font colour: 0X%08" PRIX32, Mem.OwnColour);            
 Tekstprintlnf("    DimmedLetter: 0X%08" PRIX32,Mem.DimmedLetter);          
 Tekstprintlnf("      BackGround: 0X%08" PRIX32,Mem.BackGround);                   
 Tekstprintlnf("  LanguageChoice: %d",Mem.LanguageChoice);                  
 Tekstprintlnf("S   LightReducer: %d",Mem.LightReducer);                    
 Tekstprintlnf("L  MinBrightness: %d",Mem.LowerBrightness);                 
 Tekstprintlnf("M  MaxBrightness: %d",Mem.UpperBrightness);                                                                                                     
 Tekstprintlnf("CCC        BLEOn: %s",Mem.BLEOn ? "ON" : "OFF");            
 Tekstprintlnf("X          NTPOn: %s",Mem.NTPOn ? "ON" : "OFF");            
 Tekstprintlnf("W         WIFIOn: %s",Mem.WIFIOn ? "ON" : "OFF");           
 Tekstprintlnf("P    StatusLEDOn: %s",Mem.StatusLEDOn ? "ON" : "OFF");      
 Tekstprintlnf("    MCUrestarted: %d",Mem.MCUrestarted );                   
 Tekstprintlnf("    LoopRebooted: %d",Mem.LoopRebooted );                   
 Tekstprintlnf("K Time log print: %s",Mem.TimeLogPrint == 0 ? "OFF" : 
                                      Mem.TimeLogPrint == 1 ? "Per minute" : 
                                      Mem.TimeLogPrint == 2 ? "Per hour" : "Undefined");         
 Tekstprintlnf("         DCF77On: %s",Mem.DCF77On  ? "ON" : "OFF");         
 Tekstprintlnf("H05 TimeReceiver: %s",Mem.TimeReceiver ? "ON" : "OFF"); 
 Tekstprintlnf("      TimeSender: %s",Mem.TimeSender ? "ON" : "OFF");   
 Tekstprintlnf("H      TimeInput: %d",Mem.TimeInput);                       
 PrintTimeInputMethod(Mem.TimeInput);
 Tekstprintlnf("J      UseDS3231: %s",Mem.UseDS3231 ? "ON" : "OFF");        
Tekstprintlnf("%%      LED strip: %s",Mem.LEDstrip?"WS2812":"SK6812" );    
 Tekstprintlnf("      FiboChrono: %s",Mem.FiboChrono ? "FIBO" : "CHRONO");  
 Tekstprintlnf("          NoExUl: %s",Mem.NoExUl ? "ON" : "OFF");          
 byte wc = Mem.WIFIcredentials; 
 Tekstprintlnf(" WIFIcredentials: %s", wc==0? "Not SET" : wc==1? "SET" : wc==2? "SET&OK": 
                                       wc==3? "in AP not SET":"Unknown code");   
 Tekstprintlnf("      IntFuture2: %d",Mem.IntFuture2 );  
 Tekstprintlnf("}     Ringbufcnt: %s",Mem.Ringbufcnt ? "ON" : "OFF");                     
 Tekstprintlnf("        HC12Time: %s",Mem.HC12Time ? "ON" : "OFF");  
 Tekstprintlnf("     byteFuture4: %d",Mem.byteFuture4 );                                         
 Tekstprintlnf(")     HET IS WAS: %s",Mem.HetIsWasOff ? "OFF" : "ON");     
 Tekstprintlnf("(      EDSOFT is: %s",Mem.EdSoftLEDSOn ? "ON" : "OFF");    
 Tekstprintlnf("~  RandomDisplay: %s",Mem.RandomDisplay? "ON" : "OFF");    
 Tekstprintlnf("WIFInoConnection: %d",Mem.WIFInoConnection);               
 Tekstprintlnf("+       Fast BLE: %s",Mem.UseBLELongString?"ON":"OFF");               
 Tekstprintlnf("A           SSID: %s",Mem.SSID);                            
 // Tekstprintlnf("BackGround: %s",Mem.Password);                           
 Tekstprintlnf("C  BroadcastName: %s",Mem.BLEbroadcastName);                
 Tekstprintlnf("E       Timezone: %s",Mem.Timezone);                        
 Tekstprintlnf("        Checksum: %d",Mem.Checksum);                        
 sptext[0]=0;                                                                                 // Suppress a second print of sptext
}

//--------------------------------------------                                                //
// COMMON Print memory space
//--------------------------------------------
void StoredStartHeaps(){ StoredStartHeaps(false); }
void StoredStartHeaps(bool Store)
{
 static uint32_t a,b,c,d,e,f;
 if(Store)
   {
    a = ESP.getFreeHeap();
    b = heap_caps_get_largest_free_block(MALLOC_CAP_8BIT);
    c = esp_get_minimum_free_heap_size();
    d = heap_caps_get_free_size(MALLOC_CAP_8BIT);
    e = heap_caps_get_free_size(MALLOC_CAP_DMA);
    f = heap_caps_get_free_size(MALLOC_CAP_SPIRAM);
   }
  else
  {
  Tekstprintln("Heaps before allocation of the ringbuffer");
  Tekstprintlnf("         Free heap: %7.1f Kbytes", a / 1024.0);
  Tekstprintlnf("     Largest block: %7.1f Kbytes", b / 1024.0);
  Tekstprintlnf("     Min free heap: %7.1f Kbytes", c / 1024.0);
  Tekstprintlnf("8-bit capable heap: %7.1f Kbytes", d / 1024.0);
  Tekstprintlnf("  DMA capable heap: %7.1f Kbytes", e / 1024.0);
  Tekstprintlnf(" SPRAM/SPIRAM heap: %7.1f Kbytes", f / 1024.0);
  PrintLine(35);
  }
}
//--------------------------------------------                                                //
// COMMON Print memory space
//--------------------------------------------
void PrintHeaps(void)
{
 StoredStartHeaps();  
 Tekstprintln("Actual heap sizes");                                                           // Print the heaps before allocation
 Tekstprintlnf("         Free heap: %7.1f Kbytes", ESP.getFreeHeap() / 1024.0);
 Tekstprintlnf("     Largest block: %7.1f Kbytes", heap_caps_get_largest_free_block(MALLOC_CAP_8BIT) / 1024.0);
 Tekstprintlnf("     Min free heap: %7.1f Kbytes", esp_get_minimum_free_heap_size()           / 1024.0);
 Tekstprintlnf("8-bit capable heap: %7.1f Kbytes", heap_caps_get_free_size(MALLOC_CAP_8BIT)   / 1024.0);
 Tekstprintlnf("  DMA capable heap: %7.1f Kbytes", heap_caps_get_free_size(MALLOC_CAP_DMA)    / 1024.0);
 Tekstprintlnf(" SPRAM/SPIRAM heap: %7.1f Kbytes", heap_caps_get_free_size(MALLOC_CAP_SPIRAM) / 1024.0);
}

//--------------------------------------------                                                //
// COMMON LDR reading are between 0 and 255. 
// ESP32 analogue read is between 0 - 4096 --   is: 4096 / 8
//--------------------------------------------
int ReadLDR(void)
{
 return analogRead(PhotoCellPin) / 16;
}


//--------------------------------------------                                                //
// CLOCK Display the time 
// This function is controlled by Mem.TimeLogPrint and called when time is changed by some input
//--------------------------------------------
void Displaytime(void)
{ 
 if(Mem.HC12Time) SendHC12TimeString();                                                       // HC12 Send time via HC-12 on D4
}

//--------------------------------------------                                                //
// CLOCK Read LDR and update brightness variables
//--------------------------------------------
void ReadAndAverageLDR(void) {ReadAndAverageLDR(false);}
void ReadAndAverageLDR(bool clean)
{
 LDRread           = ReadLDR();                                                               // Raw LDR value (also used for print in DimLeds)
 int LDRavgread    = clean ? LDRread                                                          // Clean read: bypass smoothing, reset average directly
                           : (4 * Previous_LDR_read + LDRread) / 5;                          // Normal read: smooth rapid light intensity changes
 Previous_LDR_read = LDRavgread;
 OutPhotocell      = (uint32_t)((Mem.LightReducer * sqrt(255 * LDRavgread)) / 100);          // Linear --> hyperbolic with sqrt. Result is between 0-255
 OutPhotocell      = constrain(OutPhotocell, Mem.LowerBrightness, Mem.UpperBrightness);
 MinPhotocell      = min(MinPhotocell, LDRavgread);
 MaxPhotocell      = max(MaxPhotocell, LDRavgread);
 SumLDRreadshour  += LDRavgread;   NoofLDRreadshour++;
}

//--------------------------------------------                                                //
// CLOCK Dim the leds measured by the LDR and print values
// LDR reading are between 0 and 255. The Brightness send to the LEDs is between 0 and 255
//--------------------------------------------
void DimLeds(bool print)
{
 ReadAndAverageLDR();
 if(print)
   {
    PrintTimeHMS(1);                                                                          //
    char tempStr[10] = "";
    char posStr[30]  = "";
    if (Mem.UseDS3231)  snprintf(tempStr, sizeof(tempStr), "%0.0fC", RTCklok.getTemperature());
    if (Mem.Ringbufcnt) snprintf(posStr, sizeof(posStr), "@%u ->%u", LogWritePos, LogBufferSize-LogWritePos);
    snprintf(sptext, sizeof(sptext), "LDR:%3d->%2d%% %3lu kl/s %s%s ",
            LDRread, (int)(OutPhotocell * 100 / 255), Loopcounter / 1000, posStr, tempStr);               
    if(TestLDR) Tekstprintln(sptext);
    else Tekstprint(sptext); 
    sptext[0] = 0;
   }
 if(LEDsAreOff) OutPhotocell = 0;
 SetBrightnessLeds(OutPhotocell);     // values between 0 and 255
}

// --------------------Colour Clock Light functions -----------------------------------
//--------------------------------------------                                                //
// LED Set color for LEDs in strip and print tekst
//---------------------------------------------
void ColorLeds(char const *Tekst, int FirstLed, int LastLed, uint32_t RGBWColor)
{ 
 Stripfill(RGBWColor, FirstLed, ++LastLed - FirstLed );                                        //
 if (!NoTextInLeds && strlen(Tekst) > 0 )
     { snprintf(sptext, sizeof(sptext),"%s ",Tekst); Tekstprint(sptext); }                     // Print the text  
}
//--------------------------------------------
// LED Set color for one LED
//--------------------------------------------
void ColorLed(int Lednr, uint32_t RGBWColor)
{   
 Stripfill(RGBWColor, Lednr, 1 );
}
//--------------------------------------------                                                //
// LED Clear display settings of the LEDs
//--------------------------------------------
void LedsOff(void) 
{ 
 Stripfill(0, 0, NUM_LEDS );                                                                  // 
}
//--------------------------------------------                                                //
// LED Turn On and the LEDs off after Delaymsec milliseconds
//--------------------------------------------
void Laatzien(int Delaymsec) 
{ 
 ShowLeds(); 
 delay(Delaymsec);
 LedsOff(); 
 CheckDevices();                                                                              // Check for input from input devices
}

//--------------------------------------------                                                //
// LED Push data in LED strip to commit the changes
//--------------------------------------------
void ShowLeds(void) { LEDstrip.show(); }
//--------------------------------------------                                                //
// LED Set brighness of LEDs
//--------------------------------------------
void SetBrightnessLeds(byte Bright)
{
 LEDstrip.setBrightness(Bright);                                                              // Set brightness of LEDs   
 ShowLeds();
}
//--------------------------------------------
// LED Fill the strip array
//--------------------------------------------
void Stripfill(uint32_t RGBWColor, int FirstLed, int NoofLEDs)
{   
 LEDstrip.fill(RGBWColor, FirstLed, NoofLEDs);
}
//--------------------------------------------
// LED Strip Get Pixel Color 
//--------------------------------------------
uint32_t StripGetPixelColor(int Lednr)
{
 return(LEDstrip.getPixelColor(Lednr));
}
//--------------------------------------------                                                //
// LED Synchronize the colour of the LEDstrip with the Status LED
// Used during Setup(). if LEDcolour == 9999 -> clear the display
//--------------------------------------------
void LEDstartup(uint32_t LEDColour)
{
 static uint32_t ProgressLedNr = 0;
 if (LEDColour == CLEARLEDSTARTUP)  
    for(int n = ProgressLedNr-1; n>=0; n--)
      {
       ColorLed(n,0); 
       ShowLeds(); 
       delay(200);
      }
 else
   {
    ColorLed(ProgressLedNr++,LEDColour); 
    ShowLeds();   
    SetStatusLED(Cred(LEDColour),Cgreen(LEDColour),Cblue(LEDColour));  
   }
}

//--------------------------------------------                                                //
// LED convert HSV to RGB  h is from 0-360, s,v values are 0-1
// r,g,b values are 0-255
// brief Convert HSV values to packed RGBW format (white = 0).
// param H Hue angle (0–360) param S Saturation (0–1) param V Value/Brightness (0–1)
// return Packed RGBW uint32_t value
//--------------------------------------------
uint32_t HSVToRGB(double H, double S, double V) 
{
 int i;
 double r, g, b, f, p, q, t;
 if (S == 0)  {r = V;  g = V;  b = V; }
 else
  {
   H >= 360 ? H = 0 : H /= 60;
   i = (int) H;
   f = H - i;
   p = V * (1.0 -  S);
   q = V * (1.0 - (S * f));
   t = V * (1.0 - (S * (1.0 - f)));
   switch (i) 
    {
     case 0:  r = V;  g = t;  b = p;  break;
     case 1:  r = q;  g = V;  b = p;  break;
     case 2:  r = p;  g = V;  b = t;  break;
     case 3:  r = p;  g = q;  b = V;  break;
     case 4:  r = t;  g = p;  b = V;  break;
     default: r = V;  g = p;  b = q;  break;
    }
  }
return FuncCRGBW((int)(r*255), (int)(g*255), (int)(b*255), 0 );                                // R, G, B, W 
}
//--------------------------------------------                                                //
// LED function to make RGBW colour
//--------------------------------------------
uint32_t FuncCRGBW( uint32_t Red, uint32_t Green, uint32_t Blue, uint32_t White)
{ 
 return ( (White<<24) + (Red << 16) + (Green << 8) + Blue );
}
//--------------------------------------------                                                //
// LED functions to extract RGBW colours
//--------------------------------------------
 uint8_t Cwhite(uint32_t c) { return (c >> 24);}
 uint8_t Cred(  uint32_t c) { return (c >> 16);}
 uint8_t Cgreen(uint32_t c) { return (c >> 8); }
 uint8_t Cblue( uint32_t c) { return (c);      }


//--------------------------------------------                                                //
//  DISPLAY Clear the display
//--------------------------------------------
void ClearScreen(void)
{
 LedsOff();
}

//--------------------------------------------                                                //
// DISPLAY Initialyse the LEDstrip for WS2812 or SK6812 LEDs
//--------------------------------------------
void StartLeds(void) 
{
 switch (Mem.LEDstrip)
    {
      case 0: LEDstrip = LED6812strip; 
              white  = 0xFF000000; 
              lgray  = 0x66000000;  
              gray   = 0x33000000;                                                            // The SK6812 LED has a white LED that is pure white
              dgray  = 0x22000000;
              wgray  = 0xAA000000; 

